#+TITLE: SME0822 - Análise Multivariada e Aprendizado Não Supervisionado
#+EMAIL: francisco.miranda@usp.br

* Atividade 3 - Francisco Miranda - 4402962

Exercícios para entrega em 15/09/2022

#+begin_src R :session m
# bibliotecas utilizadas
library(tidyverse)
library(ggExtra)
library(ascii)
options(asciiType = "org")
#+end_src

#+RESULTS:
: org

** Exercício 2

#+begin_src R :session m

n <- 42
mu <- c(0.564, 0.603)S
S <- matrix(c(0.0144, 0.0117, 0.0117, 0.0146), ncol = 2)

#+end_src

#+RESULTS:
| 0.0144 | 0.0117 |
| 0.0117 | 0.0146 |


** Exercício 4


#+begin_src R :session m :results output :exports code results
iris |> pivot_longer(cols = !"Species") |>
  ggplot(aes(x = Species, y = value, fill = Species)) +
  geom_boxplot() +
  facet_wrap(~name)
#+end_src

#+RESULTS:


#+begin_src R :session m :results output :exports code results

fit <- manova(
  cbind(Sepal.Length, Sepal.Width, Petal.Length, Petal.Width)
     ~ Species, data = iris)

summary(fit)
#+end_src

#+RESULTS:
:            Df Pillai approx F num Df den Df    Pr(>F)
: Species     2 1.1919   53.466      8    290 < 2.2e-16 ***
: Residuals 147
: ---
: Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

** Exercicio 5.9

#+begin_src R :session m :results output
M <- matrix(c(3266.46, 1343.97, 731.54, 1175.50, 162.68, 238.37,
              1343.97, 721.91, 324.25, 537.35, 80.17, 117.73,
              731.54, 324.25, 179.28, 281.17, 39.15, 56.80,
              1175.50, 537.35, 281.17, 474.98, 63.73, 94.85,
              162.68, 80.17, 39.15, 63.73, 9.95, 13.88,
              238.37, 117.73, 56.80, 94.85, 13.88, 21.26),
            nrow = 6, ncol = 6, byrow = T)
colnames(M) <- c("Peso","Comprimento Corporal","Pescoco",
                 "Perímetro", "Comprimento Cabeca", "Largura Cabeca")
mu <- c(95.52, 164.38, 55.69, 93.39, 17.98, 31.13)
n <- 61
p <- 6
#+end_src

#+RESULTS:
: 6

*** (a) Intervalos de 95% de confiança simultâneos para as seis medidas

\[
IC(\mu, \gamma) = \mu \pm z_\gamma \sqrt{\frac{\sigma^2}{n}}
\]


#+begin_src R :session m :results output org :exports code results

# Intervalos  simulatânea de 95% de confiança

crit <- qf(0.05, p, n - p, lower.tail = F)
# Máximo erro
E <- sqrt((n-1)*p*crit/(n-p))* sqrt(diag(M)/n)
# intervals
LI = mu -  E
LS = mu +  E

Res=cbind(mu, LI, LS)
colnames(Res)=c("D_bar", "LI","LS")
print(Res, digits = 3, type = "org")
#+end_src

#+RESULTS:
#+begin_src org
     D_bar    LI    LS
[1,]  95.5  67.3 123.7
[2,] 164.4 151.1 177.6
[3,]  55.7  49.1  62.3
[4,]  93.4  82.6 104.1
[5,]  18.0  16.4  19.5
[6,]  31.1  28.9  33.4
#+end_src


*** (b) Elipse de 95% de confiança para a média do pescoço e peso Médio das 6 populações

#+begin_src R :session m :results output org :exports code results

# n(xbar - mu)' s-1 (xbar-mu)
#+end_src

*** (c) Intervalos de 95% de confiança de Bonferroni simultâneos para as seis medidas


#+begin_src R :session m :results output org :exports code results

##################################################
# Intervalos  de 95% de confiança de Bonferroni
##################################################

crit <- qt(0.05/(2*4), n-1, lower.tail = F)
# Máximo erro
E <- crit* sqrt(diag(M)/n)
# intervals
LI = mu -  E
LS = mu +  E

Res=cbind(mu, LI, LS)
colnames(Res)=c("D_bar", "LI","LS")
print(Res,digits=3, type = "org")
#+end_src

#+RESULTS:
|  95.52 | 76.6752410837607 | 114.364758916239 |
| 164.38 | 155.520821696881 | 173.239178303119 |
|  55.69 | 51.2751308586459 | 60.1048691413541 |
|  93.39 | 86.2039609111859 | 100.576039088814 |
|  17.98 | 16.9399278820849 | 19.0200721179151 |
|  31.13 | 29.6096851284056 | 32.6503148715944 |

** Exercício 5.20

** Exercício 6.3

** Exercício 6.8
